# Helpers
tap 'github/bootstrap'
tap 'nektos/tap'

# skipping install docker, lets do this manually
brew 'amazon-ecs-cli'
brew 'asciidoc'
brew 'bash-completion'
brew 'cmake'
brew 'coreutils'
brew 'corkscrew'
brew 'docbook'
brew 'gdbm'
brew 'htop'
brew 'jq'
brew 'lastpass-cli'
brew 'libassuan'
brew 'libgpg-error'
brew 'libyaml'
brew 'ncdu'         # disk usage tool
brew 'oniguruma'
brew 'openssl'
brew 'perl'
brew 'pinentry'
brew 'pkg-config'
# brew 'python@2'
brew 'readline'
brew 'shellcheck'
brew 'sqlite'
brew 'vim'
brew 'watch'
# for node manager
brew 'nvm'
# act tool https://github.com/nektos/act
# brew 'nektos/tap/act'
brew 'rbenv'
brew 'git'
brew 'git-lfs'
brew 'gh'


# cask "docker"
cask 'gpg-suite'
brew 'azure-cli'

brew 'gnupg'
brew 'golang'

