# Helpers
tap 'github/bootstrap'

# skipping install docker, lets do this manually
# cask "docker"
brew 'jq'
brew 'asciidoc'
brew 'cmake'
brew 'corkscrew'
brew 'gdbm'
brew 'libassuan'
brew 'libyaml'
brew 'openssl'
brew 'pinentry'
brew 'python'
brew 'ruby'
brew 'sqlite'
brew 'bash-completion'
brew 'coreutils'
brew 'docbook'
brew 'htop'
brew 'lastpass-cli'
brew 'libgpg-error'
brew 'oniguruma'
brew 'perl'
brew 'pkg-config'
brew 'readline'
brew 'shellcheck'
brew 'vim'
